{
  "_remove_final_layer_norm": false,
  "activation_function": "relu",
  "architectures": [
    "LlagaOPTForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 2,
  "do_layer_norm_before": false,
  "dropout": 0.1,
  "dtype": "float32",
  "enable_bias": true,
  "eos_token_id": 2,
  "ffn_dim": 256,
  "hidden_size": 64,
  "init_std": 0.02,
  "layer_norm_elementwise_affine": true,
  "layerdrop": 0.0,
  "max_position_embeddings": 512,
  "model_type": "llaga_opt",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "pad_token_id": 1,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "use_cache": true,
  "vocab_size": 152,
  "word_embed_proj_dim": 64
}
